## 08. 결합

## 참고자료
* [Python 완전정복 시리즈] 2편 : Pandas DataFrame 완전정복 : https://wikidocs.net/book/7188

In [1]:
import pandas as pd
import numpy as np

## 함수를 이용한 열 단위 결합(combine)

In [2]:
n=np.NaN
col = ['col1','col2','col3']
row = ['row1','row2','row3']
data1 = [[1,3,4],
         [n,8,2],
         [2,6,7]]
data2 = [[7,2,3],
         [2,4,2],
         [3,1,5]]
df1 = pd.DataFrame(data1,row,col)
df2 = pd.DataFrame(data2,row,col)

In [3]:
df1

      col1  col2  col3
row1   1.0     3     4
row2   NaN     8     2
row3   2.0     6     7

In [4]:
df2

      col1  col2  col3
row1     7     2     3
row2     2     4     2
row3     3     1     5

In [6]:
df1.combine(df2, np.maximum)

      col1  col2  col3
row1   7.0     3     4
row2   NaN     8     2
row3   3.0     6     7

In [7]:
# fill_value 이용하여 결측치 채워 결합

df1.combine(df2, np.maximum, fill_value=9)

      col1  col2  col3
row1   7.0     3     4
row2   9.0     8     2
row3   3.0     6     7

In [8]:
col3 = ['col1','col2']
row3 = ['row1','row2']
data3 = [[1,2],
         [3,4]]
df3 = pd.DataFrame(data3, row3, col3)
df3

      col1  col2
row1     1     2
row2     3     4

In [9]:
# overwite 인수의 사용

# overwrite가 False일 경우 존재하지 않는 열에 대해서는 기존값으로 채워집니다.

df1.combine(df3, np.maximum,overwrite=False)

      col1  col2  col3
row1   1.0   3.0     4
row2   NaN   8.0     2
row3   NaN   NaN     7

In [10]:
# overwrite가 True일 경우 존재하지 않는 열에 대해서는 NaN으로 채워집니다.

df1.combine(df3, np.maximum,overwrite=True)

      col1  col2  col3
row1   1.0   3.0   NaN
row2   NaN   8.0   NaN
row3   NaN   NaN   NaN

## 다른 객체로 결측치 덮어쓰기(combine_first)

In [11]:
n=np.NaN
col = ['col1','col2','col3']
row = ['row1','row2','row3']
data1 = [[n,n,1],
         [n,n,1],
         [1,1,1]]
data2 = [[2,2,2],
         [2,n,2],
         [2,1,2]]
df1 = pd.DataFrame(data1,row,col)
df2 = pd.DataFrame(data2,row,col)

In [12]:
df1

      col1  col2  col3
row1   NaN   NaN     1
row2   NaN   NaN     1
row3   1.0   1.0     1

In [13]:
df2

      col1  col2  col3
row1     2   2.0     2
row2     2   NaN     2
row3     2   1.0     2

In [14]:
df1.combine_first(df2)

      col1  col2  col3
row1   2.0   2.0     1
row2   2.0   NaN     1
row3   1.0   1.0     1

## 인덱스 기준 병합(join)

In [15]:
df1 = pd.DataFrame({'col1':[1,2,3]},index=['row3','row2','row1'])
df1

      col1
row3     1
row2     2
row1     3

In [16]:
df2 = pd.DataFrame({'col2':[13,14]},index=['row4','row3'])
df2

      col2
row4    13
row3    14

In [17]:
df3 = pd.DataFrame({'col1':[23,24]},index=['row4','row3'])
df3

      col1
row4    23
row3    24

In [18]:
df1.join(df2,how='left')

      col1  col2
row3     1  14.0
row2     2   NaN
row1     3   NaN

In [19]:
df1.join(df2, how='right')

      col1  col2
row4   NaN    13
row3   1.0    14

In [20]:
df1.join(df2, how='outer')

      col1  col2
row1   3.0   NaN
row2   2.0   NaN
row3   1.0  14.0
row4   NaN  13.0

In [21]:
df1.join(df2, how='inner')

      col1  col2
row3     1    14

In [22]:
df1.join(df2,how='left')

      col1  col2
row3     1  14.0
row2     2   NaN
row1     3   NaN

In [23]:
df1.join(df2,how='left',sort=True)

      col1  col2
row1     3   NaN
row2     2   NaN
row3     1  14.0

In [24]:
df1.join(df2,how='left',sort=False)

      col1  col2
row3     1  14.0
row2     2   NaN
row1     3   NaN

In [26]:
# df1과 df3은 col1의 중복된 이름을 가진 열을 가지므로 join 메서드 사용시 오류 발생
# lsuffix / rsuffix를 이용하여 기존 열 이름에 접미사 붙일 수 있음

df1.join(df3,how='outer',lsuffix="_left",rsuffix='_right')

      col1_left  col1_right
row1        3.0         NaN
row2        2.0         NaN
row3        1.0        24.0
row4        NaN        23.0

In [27]:
df4 = pd.DataFrame({'IDX':['A','B','C'],'col1':[1,2,3]})
df4

  IDX  col1
0   A     1
1   B     2
2   C     3

In [28]:
df5 = pd.DataFrame({'IDX':['C','D'],'col2':[13,14]})
df5

  IDX  col2
0   C    13
1   D    14

In [29]:
# join 메서드는 기본적으로 index 기준으로 결합하므로 열 기준으로 결합하기 위해서 set_index로 열을 인덱스로 변경하여 join 사용

df4.set_index('IDX').join(df5.set_index('IDX'))

     col1  col2
IDX
A       1   NaN
B       2   NaN
C       3  13.0

In [30]:
# 인덱스가 열 값으로 변경되는 것이 아니라 순수하게 열 기준으로 병합하려면 on 인수 사용ㅠ

df4.join(df5.set_index('IDX'),on='IDX')

  IDX  col1  col2
0   A     1   NaN
1   B     2   NaN
2   C     3  13.0

## 객체병합(merge)

In [31]:
# 열 기준으로 병합(left_on, right_on)
df1 = pd.DataFrame({'IDX1':['a','b','c','a'],'VAL':[1,2,3,4]})
df2 = pd.DataFrame({'IDX2':['a','c','d'],'VAL':[5,6,7]})

In [32]:
df1

  IDX1  VAL
0    a    1
1    b    2
2    c    3
3    a    4

In [33]:
df2

  IDX2  VAL
0    a    5
1    c    6
2    d    7

In [34]:
df1.merge(df2, left_on='IDX1', right_on='IDX2')

# 이름이 같은 VAL 열에 _x와 _y 붙음

  IDX1  VAL_x IDX2  VAL_y
0    a      1    a      5
1    a      4    a      5
2    c      3    c      6

In [35]:
df1.merge(df2, left_on='IDX1',right_on='IDX2',suffixes=('_left','_right'))

  IDX1  VAL_left IDX2  VAL_right
0    a         1    a          5
1    a         4    a          5
2    c         3    c          6

In [36]:
# 인덱스 기준으로 병합(left_index, right_index)
df3 = pd.DataFrame({'VAL1':[1,2,3]},index=['row1','row2','row3'])
df4 = pd.DataFrame({'VAL2':[4,5,6]},index=['row2','row3','row4'])

In [37]:
df3

      VAL1
row1     1
row2     2
row3     3

In [38]:
df4

      VAL2
row2     4
row3     5
row4     6

In [39]:
df3.merge(df4, left_index=True,right_index=True)

      VAL1  VAL2
row2     2     4
row3     3     5

In [41]:
# 열과 인덱스를 혼합하여 병합하기
df5 = pd.DataFrame({'VAL1':[1,2,3]},index=['row1','row2','row3'])
df5

      VAL1
row1     1
row2     2
row3     3

In [42]:
df6 = pd.DataFrame({'IDX':['row2','row3','row4'],'VAL2':[4,5,6]})
df6

    IDX  VAL2
0  row2     4
1  row3     5
2  row4     6

In [43]:
df5.merge(df6, left_index=True,right_on='IDX')

   VAL1   IDX  VAL2
0     2  row2     4
1     3  row3     5

In [44]:
# how 인수의 사용

df7 = pd.DataFrame({'IDX':['a','b','c','a'],'VAL':[1,2,3,4]})
df8 = pd.DataFrame({'IDX':['a','c','d'],'VAL':[5,6,7]})

In [45]:
df7

  IDX  VAL
0   a    1
1   b    2
2   c    3
3   a    4

In [46]:
df8

  IDX  VAL
0   a    5
1   c    6
2   d    7

In [47]:
df7.merge(df8,how='left',on='IDX')

  IDX  VAL_x  VAL_y
0   a      1    5.0
1   b      2    NaN
2   c      3    6.0
3   a      4    5.0

In [48]:
df7.merge(df8,how='right',on='IDX')

  IDX  VAL_x  VAL_y
0   a    1.0      5
1   a    4.0      5
2   c    3.0      6
3   d    NaN      7

In [49]:
df7.merge(df8,how='inner',on='IDX')

  IDX  VAL_x  VAL_y
0   a      1      5
1   a      4      5
2   c      3      6

In [50]:
df7.merge(df8,how='outer',on='IDX')

  IDX  VAL_x  VAL_y
0   a    1.0    5.0
1   a    4.0    5.0
2   b    2.0    NaN
3   c    3.0    6.0
4   d    NaN    7.0

In [51]:
df7.merge(df8,how='outer',on='IDX',indicator=True)

  IDX  VAL_x  VAL_y      _merge
0   a    1.0    5.0        both
1   a    4.0    5.0        both
2   b    2.0    NaN   left_only
3   c    3.0    6.0        both
4   d    NaN    7.0  right_only

In [52]:
df7.merge(df8,how='outer',on='IDX',validate='1:m')

MergeError: Merge keys are not unique in left dataset; not a one-to-many merge

In [53]:
df7.merge(df8,how='outer',on='IDX',validate='m:1')

  IDX  VAL_x  VAL_y
0   a    1.0    5.0
1   a    4.0    5.0
2   b    2.0    NaN
3   c    3.0    6.0
4   d    NaN    7.0

In [55]:
# how 인수에 cross 적용
df9 = pd.DataFrame({'IDX1':['a','b']})
df10 = pd.DataFrame({'IDX2':['c','d']})

In [56]:
df9

  IDX1
0    a
1    b

In [57]:
df10

  IDX2
0    c
1    d

In [59]:
df9.merge(df10, how='cross')

  IDX1 IDX2
0    a    c
1    a    d
2    b    c
3    b    d

## 객체 병합_결측제어(align)

In [60]:
n=np.NaN
col1 = ['col1','col2','col3']
row1 = ['row1','row2','row3']
data1 = [[1,2,3],[5,6,7],[9,n,11]]

col2 = ['col2','col3','col4']
row2 = ['row3','row4','row5']
data2 = [[10,11,12],[14,n,16],[18,19,20]]

df1 = pd.DataFrame(data1,row1,col1)
df2 = pd.DataFrame(data2,row2,col2)

In [61]:
df1

      col1  col2  col3
row1     1   2.0     3
row2     5   6.0     7
row3     9   NaN    11

In [62]:
df2

      col2  col3  col4
row3    10  11.0    12
row4    14   NaN    16
row5    18  19.0    20

In [67]:
df1.align(df2, join='outer')

(      col1  col2  col3  col4
 row1   1.0   2.0   3.0   NaN
 row2   5.0   6.0   7.0   NaN
 row3   9.0   NaN  11.0   NaN
 row4   NaN   NaN   NaN   NaN
 row5   NaN   NaN   NaN   NaN,
       col1  col2  col3  col4
 row1   NaN   NaN   NaN   NaN
 row2   NaN   NaN   NaN   NaN
 row3   NaN  10.0  11.0  12.0
 row4   NaN  14.0   NaN  16.0
 row5   NaN  18.0  19.0  20.0)

In [63]:
df1.align(df2,join='outer')[0]

      col1  col2  col3  col4
row1   1.0   2.0   3.0   NaN
row2   5.0   6.0   7.0   NaN
row3   9.0   NaN  11.0   NaN
row4   NaN   NaN   NaN   NaN
row5   NaN   NaN   NaN   NaN

In [64]:
df1.align(df2,join='outer')[1]

      col1  col2  col3  col4
row1   NaN   NaN   NaN   NaN
row2   NaN   NaN   NaN   NaN
row3   NaN  10.0  11.0  12.0
row4   NaN  14.0   NaN  16.0
row5   NaN  18.0  19.0  20.0

In [65]:
df1.align(df2,join='left')[0]

      col1  col2  col3
row1     1   2.0     3
row2     5   6.0     7
row3     9   NaN    11

In [66]:
df1.align(df2,join='left')[1]

      col1  col2  col3
row1   NaN   NaN   NaN
row2   NaN   NaN   NaN
row3   NaN  10.0  11.0

In [68]:
df1.align(df2,join='right')[0]

      col2  col3  col4
row3   NaN  11.0   NaN
row4   NaN   NaN   NaN
row5   NaN   NaN   NaN

In [69]:
df1.align(df2,join='right')[1]

      col2  col3  col4
row3    10  11.0    12
row4    14   NaN    16
row5    18  19.0    20

In [70]:
df1.align(df2, join='inner')[0]

      col2  col3
row3   NaN    11

In [71]:
df1.align(df2, join='inner')[1]

      col2  col3
row3    10  11.0

In [72]:
# axis 인수를 통해 정렬 진행 축 설정

df1.align(df2,join='inner',axis=0)[0]

      col1  col2  col3
row3     9   NaN    11

In [73]:
df1.align(df2,join='inner',axis=1)[0]

      col2  col3
row1   2.0     3
row2   6.0     7
row3   NaN    11

In [74]:
df1.align(df2,join='outer',fill_value='X')[0]

     col1 col2 col3 col4
row1    1  2.0    3    X
row2    5  6.0    7    X
row3    9  NaN   11    X
row4    X    X    X    X
row5    X    X    X    X

In [76]:
df1.align(df2,join='outer',fill_value='X')[1]

     col1 col2  col3 col4
row1    X    X     X    X
row2    X    X     X    X
row3    X   10  11.0   12
row4    X   14   NaN   16
row5    X   18  19.0   20

In [78]:
df1.align(df2,join='outer',method='ffill')[0]

      col1  col2  col3  col4
row1   1.0   2.0   3.0   NaN
row2   5.0   6.0   7.0   NaN
row3   9.0   6.0  11.0   NaN
row4   9.0   6.0  11.0   NaN
row5   9.0   6.0  11.0   NaN

In [79]:
df1.align(df2,join='outer',method='bfill')[1]

      col1  col2  col3  col4
row1   NaN  10.0  11.0  12.0
row2   NaN  10.0  11.0  12.0
row3   NaN  10.0  11.0  12.0
row4   NaN  14.0  19.0  16.0
row5   NaN  18.0  19.0  20.0

In [80]:
df1.align(df2,join='outer',method='bfill',limit=1)[1]

      col1  col2  col3  col4
row1   NaN   NaN   NaN   NaN
row2   NaN  10.0  11.0  12.0
row3   NaN  10.0  11.0  12.0
row4   NaN  14.0  19.0  16.0
row5   NaN  18.0  19.0  20.0

In [81]:
df1.align(df2,join='outer',method='ffill',fill_axis=0)[0]

      col1  col2  col3  col4
row1   1.0   2.0   3.0   NaN
row2   5.0   6.0   7.0   NaN
row3   9.0   6.0  11.0   NaN
row4   9.0   6.0  11.0   NaN
row5   9.0   6.0  11.0   NaN

In [82]:
df1.align(df2,join='outer',method='ffill',fill_axis=1)[0]

      col1  col2  col3  col4
row1   1.0   2.0   3.0   3.0
row2   5.0   6.0   7.0   7.0
row3   9.0   9.0  11.0  11.0
row4   NaN   NaN   NaN   NaN
row5   NaN   NaN   NaN   NaN

## 업데이트(update)

In [83]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[n,5,6]})
df2 = pd.DataFrame({'B':[24,n,26],'C':[37,38,39]})

In [84]:
df1

   A    B
0  1  NaN
1  2  5.0
2  3  6.0

In [85]:
df2

      B   C
0  24.0  37
1   NaN  38
2  26.0  39

In [ ]:
# over